. 6380
the 4198
, 3674
and 3516
I 2791
a 2185
to 2051
was 1926
of 1548
is 1463
! 1392
it 1297
in 1138
for 1105
The 1049
food 969
that 793
with 769
you 731
but 714
this 705
my 636
have 636
n't 630
place 628
not 618
's 604
good 589
they 585
on 575
were 574
had 572
we 571
are 497
) 480
so 479
at 475
Chinese 443
here 442
( 436
be 433
as 392
very 384
like 383
We 380
service 369
chicken 340
out 339
there 336
all 331
just 322
great 321
from 313
... 311
It 300
restaurant 300
get 282
order 276
me 271
their 270
would 270
time 270
do 266
one 256
back 255
rice 252
our 251
or 249
us 246
go 244
if 243
This 231
about 226
They 223
up 219
soup 217
ordered 216
can 215
$ 214
've 214
really 213
will 210
which 210
some 209
been 207
only 206
an 204
did 204
? 198
too 190
what 190
your 186
no 184
menu 184
: 182
- 182
sauce 181
more 181
when 180
even 178
pork 177
because 177
fried 173
got 172
beef 172
My 171
also 169
other 168
best 167
try 166
hot 166
them 162
eat 158
by 156
lunch 154
'' 153
`` 151
always 149
dishes 146
than 145
'm 145
better 143
noodles 143
much 142
came 141
delicious 140
little 138
well 134
take 133
people 132
friendly 130
could 128
nice 127
never 127
again 126
over 124
pretty 123
come 123
sum 123
has 121
bad 121
If 121
& 119
after 119
know 118
shrimp 117
dim 116
egg 116
dish 116
any 115
first 114
wait 113
love 113
fresh 113
meal 110
made 107
tried 105
spicy 103
definitely 103
how 102
staff 101
think 100
recommend 97
i 97
crab 96
most 96
she 95
went 93
give 93
quality 91
experience 91
since 91
make 91
price 90
buffet 90
down 90
two 90
he 89
Vegas 89
places 89
favorite 88
ever 88
going 88
're 87
flavor 87
sushi 86
bit 86
2 86
way 86
sure 86
few 86
There 85
taste 85
area 85
before 85
off 85
table 84
around 84
small 83
sweet 83
right 82
am 82
said 81
times 81
minutes 80
dinner 80
tasty 80
eating 79
many 79
Great 79
meat 79
duck 79
sour 78
5 78
say 78
where 78
amazing 77
Asian 77
thing 77
noodle 77
Food 77
want 77
pot 76
took 76
You 76
last 76
Not 75
Chicken 75
then 75
new 74
stars 74
But 74
3 74
who 73
authentic 73
night 73
server 73
prices 73
her 72
broth 72
lot 71
chinese 71
A 71
everything 71
find 71
cooked 70
And 70
rolls 69
something 69
different 69
-- 69
now 68
So 68
big 67
fish 67
items 67
ca 67
home 67
asked 66
same 66
'll 65
enough 65
As 65
family 64
tasted 63
restaurants 63
special 63
day 62
looking 62
away 62
worth 61
delivery 61
thought 61
next 60
still 60
clean 60
portions 60
being 60
while 59
roll 59
Good 59
see 58
When 58
another 58
coming 58
Our 58
customer 58
tea 57
should 57
long 57
4 57
super 56
into 56
looked 56
its 56
far 56
else 56
both 55
plate 55
things 55
cheap 55
fast 55
review 55
actually 55
though 54
every 54
; 54
friend 54
years 53
gave 53
reviews 53
does 53
China 53
All 53
friends 52
left 52
quite 52
his 52
why 51
happy 51
told 51
large 51
excellent 51
Everything 51
seafood 50
customers 50
full 50
'd 49
Very 49
huge 49
broccoli 49
hour 49
half 49
busy 49
kind 49
Their 48
mein 48
No 48
Also 48
Beef 47
ordering 46
must 46
usually 46
awesome 46
After 46
10 46
BBQ 46
decided 46
fun 46
these 46
used 46
legs 46
old 45
cold 45
enjoyed 45
crispy 45
portion 44
feel 44
ask 44
orange 44
visit 44
wanted 44
quick 44
dining 43
flavorful 43
those 43
probably 43
veggies 43
decent 43
served 43
water 43
soon 43
style 43
Service 43
least 43
found 42
use 42
He 42
meals 42
nothing 42
location 42
That 42
1 42
husband 42
white 41
tables 41
Do 41
salty 41
bland 41
spot 41
side 41
Mongolian 40
extra 40
town 40
dumplings 40
For 40
need 39
wrong 39
maybe 38
put 38
anything 38
tell 38
owner 38
live 38
What 38
disappointed 38
let 38
bowl 38
ate 38
guy 38
without 38
high 37
combo 37
sesame 37
less 37
couple 37
house 37
free 37
look 37
line 37
Go 36
carts 36
expect 36
absolutely 36
Just 36
close 36
star 36
fan 36
hand 36
may 36
Dim 36
such 36
eaten 36
hard 36
amount 35
inside 35
check 35
choice 35
specials 35
waiter 35
ok 35
One 34
roast 34
In 34
whole 34
drink 34
Will 34
trying 34
tofu 34
serve 33
counter 33
during 33
enjoy 33
pick 33
bring 33
greasy 33
Phoenix 33
felt 33
variety 33
reasonable 33
once 33
comes 33
done 33
wonton 32
average 32
seemed 32
person 32
helpful 32
chow 32
real 32
care 32
week 31
makes 31
top 31
through 31
tasting 31
wo 31
open 31
worst 31
filling 31
work 30
everyone 30
pepper 30
30 30
waited 30
return 30
lo 30
either 30
bean 30
Pork 30
lady 30
steamed 30
waitress 30
wife 30
stuff 30
sauces 30
Overall 30
called 29
perfect 29
name 29
Best 29
money 29
atmosphere 29
black 29
First 29
20 29
highly 29
green 29
bar 29
options 29
pieces 29
She 29
Sum 28
plates 28
sit 28
own 28
having 28
anyone 28
oil 28
three 28
room 28
remember 28
often 28
started 28
choose 28
belt 28
manager 28
getting 28
might 28
Las 28
seated 27
brought 27
perfectly 27
each 27
vegetables 27
selection 27
appetizer 27
almost 27
drinks 27
wish 27
ice 27
several 27
usual 27
end 27
cream 27
guess 27
especially 27
part 26
6 26
takeout 26
cut 26
waiting 26
walked 26
liked 26
attentive 26
deal 26
etc 26
days 26
Rice 26
However 26
NOT 26
arrived 26
lots 26
Ping 26
yet 26
quickly 26
rude 26
sitting 26
street 26
Hot 26
Express 26
wings 26
Definitely 25
kids 25
roasted 25
tender 25
Love 25
conveyor 25
group 25
door 25
Panda 25
extremely 25
making 25
until 24
mind 24
General 24
decor 24
tastes 24
mom 24
fantastic 24
kitchen 24
priced 24
overall 24
Shrimp 24
someone 24
salad 24
local 24
show 24
flavors 24
late 24
traditional 24
entree 23
spice 23
Pang 23
party 23
looks 23
terrible 23
finally 23
joint 23
gets 23
15 23
sat 23
mean 23
brown 23
texture 23
him 23
Pong 23
salt 23
slightly 23
received 23
impressed 23
Deni 22
including 22
four 22
Thai 22
drive 22
curry 22
boyfriend 22
choices 22
strip 22
saw 22
seem 22
front 22
servers 22
8 22
Yelp 22
typical 22
pay 22
today 22
orders 22
type 22
wonderful 22
offer 22
dirty 22
yummy 22
Now 22
Korean 22
instead 22
drop 21
garlic 21
Tso 21
size 21
noticed 21
cook 21
wontons 21
' 21
horrible 21
ribs 21
business 21
entrees 21
able 21
pleasant 21
prepared 21
loved 21
second 21
awful 21
closed 21
soy 21
meats 20
seen 20
reason 20
7 20
dry 20
due 20
To 20
cuisine 20
keep 20
Even 20
belly 20
pao 20
okay 20
year 20
within 20
expected 20
later 20
Spicy 20
young 20
Oh 20
slow 20
lamb 19
believe 19
Never 19
rather 19
balls 19
surprised 19
pho 19
thick 19
Soup 19
forward 19
main 19
bite 19
regular 19
stop 19
point 19
foods 19
gone 19
Noodle 19
Both 19
skin 19
owners 19
seems 19
Went 19
warm 19
tip 19
greeted 19
ago 19
plus 19
American 19
generous 18
anywhere 18
Came 18
chili 18
read 18
general 18
cart 18
Chinatown 18
pulled 18
outside 18
start 18
soups 18
onions 18
ended 18
standard 18
problem 18
wall 18
Cantonese 18
craving 18
call 18
near 18
Noodles 18
% 18
itself 18
five 18
kept 18
cool 18
poor 18
however 18
filled 18
combination 18
taking 18
item 18
twice 18
mushrooms 18
deliver 17
lettuce 17
fair 17
soft 17
Some 17
above 17
pig 17
tonight 17
phone 17
Then 17
sign 17
Would 17
solid 17
entire 17
past 17
offered 17
ginger 17
list 17
rest 17
seating 17
empty 17
behind 17
charge 17
recommended 17
low 17
casino 17
speak 17
per 17
mixed 16
Kung 16
walk 16
ready 16
Pretty 16
provided 16
bill 16
kinda 16
reading 16
= 16
House 16
glad 16
mustard 16
salmon 16
Hong 16
Ordered 16
although 16
Well 16
run 16
Horrible 16
mushroom 16
Nothing 16
man 16
ingredients 16
opinion 16
given 16
under 16
already 16
employees 16
fine 16
across 16
completely 16
daughter 16
OK 16
weekend 16
spring 16
stopped 16
saying 16
cooking 16
add 15
option 15
take-out 15
yelp 15
dark 15
Saturday 15
total 15
course 15
literally 15
fat 15
Had 15
Try 15
Egg 15
Pepper 15
appetizers 15
Wow 15
leaving 15
life 15
gross 15
hungry 15
original 15
Fried 15
Buffet 15
smaller 15
along 15
leave 15
serving 15
light 15
fact 15
barely 15
normal 15
crunchy 15
rush 14
mostly 14
simply 14
neighborhood 14
ahead 14
box 14
worse 14
Pittsburgh 14
short 14
Did 14
excited 14
share 14
favorites 14
English 14
heat 14
available 14
Palace 14
Sour 14
Two 14
dine 14
hostess 14
Kong 14
upon 14
normally 14
Pot 14
Duck 14
packed 14
shared 14
needs 14
easy 14
fancy 14
inexpensive 14
Szechuan 14
plain 14
glass 14
immediately 14
red 14
Orange 14
prefer 14
woman 14
bbq 14
somewhere 14
hours 14
please 14
expecting 14
giving 14
change 14
kung 14
trip 13
wraps 13
sick 13
to-go 13
bowls 13
card 13
others 13
recently 13
On 13
Chop 13
based 13
Lunch 13
loud 13
pad 13
goes 13
world 13
Only 13
lack 13
guys 13
corn 13
early 13
disgusting 13
elsewhere 13
level 13
Excellent 13
dipping 13
crisp 13
mouth 13
idea 13
lived 13
frozen 13
needed 13
except 13
easily 13
taken 13
piece 13
feeling 13
single 13
overly 13
calamari 13
spare 13
tons 13
miss 13
obviously 13
asian 13
help 13
knew 13
Sweet 13
girl 13
affordable 13
sad 13
longer 13
cheese 13
expensive 13
cabbage 12
station 12
shell 12
Pho 12
mediocre 12
complaint 12
delivered 12
pan 12
admit 12
minute 12
yourself 12
between 12
returning 12
paid 12
waiters 12
crowded 12
boba 12
alone 12
complain 12
Crab 12
ton 12
turn 12
outstanding 12
stuffed 12
base 12
ramen 12
nicely 12
seriously 12
mai 12
vegetable 12
Wok 12
happened 12
threw 12
cup 12
won 12
mins 12
rate 12
number 12
heard 12
moved 12
funny 12
dont 12
ambiance 12
thai 12
job 12
Please 12
Delicious 12
feet 12
ones 12
plenty 12
While 12
At 12
floor 12
refill 12
understand 12
stickers 12
lobster 12
working 12
Mai 11
enjoyable 11
Mein 11
months 11
seasoned 11
popular 11
writing 11
hit 11
Gold 11
afternoon 11
Black 11
locations 11
hate 11
healthy 11
value 11
Wei 11
basic 11
fix 11
cooks 11
myself 11
40 11
consistently 11
leftovers 11
stated 11
tough 11
Mekong 11
crazy 11
mushy 11
Thank 11
milk 11
Every 11
cake 11
pleased 11
wine 11
smelled 11
Always 11
beans 11
head 11
surprise 11
sized 11
kid 11
Sunday 11
Nice 11
peppers 11
turned 11
till 11
selections 11
doing 11
nearby 11
buns 11
pricey 11
50 11
potstickers 11
Was 10
braised 10
sometimes 10
veggie 10
Prices 10
stomach 10
worked 10
pm 10
dessert 10
totally 10
Chow 10
possible 10
sorry 10
opened 10
shu 10
store 10
stir 10
complimentary 10
clear 10
means 10
section 10
MSG 10
offers 10
smile 10
overpriced 10
alright 10
squid 10
charged 10
interior 10
Friendly 10
Highly 10
min 10
explained 10
cash 10
garbage 10
hole 10
odd 10
chef 10
juicy 10
eggplant 10
LA 10
willing 10
Staff 10
Its 10
establishment 10
paper 10
tuna 10
stay 10
pleasantly 10
Got 10
yes 10
online 10
SO 10
buffets 10
Chan 10
cost 10
Ca 10
soda 10
entertainment 10
various 10
individual 10
attitude 10
tso 10
located 10
Pao 10
Wong 10
Most 10
refilled 10
lol 10
overcooked 10
chewy 10
fortune 10
Seriously 10
mention 10
walking 10
frequent 10
appreciate 10
Bai 10
oily 9
picture 9
asking 9
none 9
basically 9
continue 9
Have 9
grab 9
included 9
meaty 9
brother 9
Pad 9
25 9
welcoming 9
moving 9
bigger 9
paying 9
stew 9
Chang 9
breakfast 9
disappointment 9
Again 9
teriyaki 9
exactly 9
Gary 9
living 9
added 9
comfortable 9
wonder 9
dimsum 9
vegas 9
driver 9
beyond 9
die 9
boring 9
hardly 9
strong 9
waste 9
rangoons 9
Sesame 9
Small 9
explain 9
says 9
Coast 9
note 9
interesting 9
Thanks 9
thats 9
limited 9
Rangoon 9
SF 9
version 9
attention 9
Upon 9
tiny 9
environment 9
weird 9
groups 9
vegetarian 9
beat 9
avoid 9
Vietnamese 9
.. 9
thinking 9
flavorless 9
larger 9
Each 9
Chubby 9
onion 9
steak 9
placed 9
Friday 9
Another 9
sliced 9
legit 9
finish 9
coupon 9
mood 9
Pei 9
notice 9
incredibly 9
double 9
fairly 9
pictures 9
satisfied 9
honestly 9
spots 9
buy 9
women 9
fatty 9
dined 9
loaded 9
chance 8
update 8
takes 8
parking 8
sticky 8
cocktail 8
* 8
spent 8
future 8
cashew 8
evening 8
Shang 8
plastic 8
higher 8
split 8
raw 8
Needless 8
/ 8
Fun 8
simple 8
driving 8
HUGE 8
generally 8
bottom 8
dollars 8
bunch 8
yum 8
9 8
hanging 8
u 8
standards 8
cookie 8
rating 8
bag 8
smell 8
music 8
game 8
hear 8
seeing 8
feed 8
entering 8
multiple 8
Lo 8
seat 8
Spring 8
boy 8
platter 8
gotten 8
tongue 8
talking 8
Here 8
PF 8
Dan 8
serious 8
LOVE 8
middle 8
Yes 8
plentiful 8
fare 8
forever 8
set 8
forgot 8
mentioned 8
consistent 8
watermelon 8
occasions 8
car 8
mall 8
parents 8
New 8
By 8
birthday 8
sugar 8
quantity 8
incredible 8
peanut 8
cups 8
beer 8
Fast 8
helped 8
pancake 8
dad 8
compared 8
THE 8
month 8
Singapore 8
batter 8
bucks 8
gives 8
broths 8
Maybe 8
heart 8
unique 8
Next 8
Still 8
expectations 8
lovely 8
ridiculous 8
corner 8
polite 8
scallops 8
Since 8
soggy 8
walls 8
Once 8
Okay 8
knife 8
chops 8
dumpling 8
positive 8
receive 8
How 8
1st 8
Ginger 8
save 8
booths 8
building 8
picking 8
edible 8
piping 8
Like 8
Other 8
anyway 8
checking 8
pass 8
sizes 8
puff 8
tomato 8
language 8
buck 7
Kwan 7
mile 7
Which 7
Roast 7
upset 7
closing 7
Star 7
entry 7
go-to 7
Of 7
missing 7
Taiwanese 7
convenient 7
Awesome 7
ground 7
favor 7
aware 7
3.5 7
2-3 7
Same 7
describe 7
carrots 7
hair 7
cause 7
lacked 7
actual 7
credit 7
bathroom 7
weeks 7
1/2 7
DO 7
Sauce 7
cucumber 7
Restaurant 7
space 7
met 7
nights 7
lucky 7
bones 7
absolute 7
opening 7
cute 7
meet 7
sides 7
skip 7
shaved 7
ten 7
Why 7
telling 7
@ 7
certain 7
disappointing 7
miso 7
Pacific 7
chose 7
happen 7
pushing 7
gem 7
n 7
considering 7
rubbery 7
Japanese 7
stick 7
together 7
smoke 7
management 7
Sorry 7
hope 7
foo 7
Price 7
stood 7
break 7
presentation 7
Fish 7
truly 7
excuse 7
chunks 7
Yum 7
apparently 7
complaints 7
Unfortunately 7
valley 7
eggrolls 7
Authentic 7
round 7
These 7
discount 7
spending 7
Lobster 7
suggested 7
Cattle 7
Roasted 7
medium 7
running 7
forks 7
breaded 7
Golden 7
efficient 7
savory 7
flavored 7
container 7
seasoning 7
morning 7
NO 7
Loved 7
mess 7
prompt 7
sold 7
scared 7
guests 7
eggroll 7
Although 7
biggest 7
finding 7
ladies 7
Sushi 7
ONLY 7
Grill 7
chop 7
daily 7
relatively 7
darn 7
Salt 7
reviewers 7
wont 7
spectacular 7
quiet 7
accommodating 7
100 7
Lake 7
unless 7
reminded 7
Chandler 7
visiting 7
Cheap 7
puffs 7
hint 7
date 7
grilled 7
Monday 7
owned 7
From 7
somewhat 7
Arizona 7
story 7
locals 7
surprisingly 7
cheaper 6
thoroughly 6
speaking 6
face 6
fake 6
4.5 6
loves 6
barbecue 6
downside 6
plaza 6
shit 6
Hawaii 6
stand 6
delight 6
BF 6
Chili 6
Been 6
appetite 6
inviting 6
Probably 6
additional 6
addition 6
shop 6
trash 6
Wall 6
trust 6
temperature 6
budget 6
wrapped 6
supposed 6
wanting 6
buds 6
impressive 6
turns 6
changed 6
Better 6
familiar 6
obvious 6
answer 6
showed 6
wok 6
waitresses 6
cookies 6
shot 6
funky 6
couples 6
mine 6
Happy 6
nearly 6
Worst 6
folks 6
talk 6
tend 6
anytime 6
bell 6
pricing 6
strange 6
everywhere 6
suppose 6
drove 6
tasteless 6
phenomenal 6
yuck 6
sea 6
notch 6
Decent 6
dozen 6
Super 6
random 6
throw 6
dried 6
appreciated 6
fruit 6
lotus 6
moist 6
Wonton 6
parties 6
Delivery 6
Broccoli 6
below 6
considered 6
modern 6
EVER 6
mix 6
workers 6
Cafe 6
walnut 6
reach 6
Hopefully 6
Shu 6
Cream 6
bother 6
visited 6
Tea 6
lacking 6
similar 6
messed 6
common 6
Jimmy 6
Such 6
apologize 6
honest 6
bathrooms 6
Changs 6
complaining 6
stupid 6
brisket 6
weekends 6
specifically 6
Pan 6
lost 6
promptly 6
hot-pot 6
correct 6
personally 6
known 6
center 6
sister 6
true 6
points 6
massive 6
gluten 6
Palms 6
hotel 6
clams 6
NEVER 6
leaves 6
Yuck 6
Ok 6
visits 6
blood 6
setting 6
Usually 6
suggest 6
courteous 6
Ho 6
Special 6
china 6
Salad 6
hands 6
watching 6
bomb 6
warned 6
closest 6
boiled 6
ma 6
towards 6
Amazing 6
accommodate 6
Is 6
bright 6
beautiful 6
matter 6
Tried 6
flower 6
comfort 6
undercooked 6
About 6
fry 6
siu 6
third 6
Customer 6
patio 6
travel 6
cant 6
Kitchen 6
joke 6
beverages 6
bottle 6
previous 6
city 6
Singing 6
hey 6
shopping 6
freshness 6
pop 6
annoying 6
begin 6
smooth 6
finished 6
Place 6
Large 6
bites 6
major 6
sort 6
Looking 6
avocado 6
Curry 6
breading 6
Fresh 6
dan 6
mainly 6
Really 6
figure 6
Stars 6
# 6
bed 5
Almost 5
combos 5
Tonight 5
Fridays 5
post 5
yelling 5
realize 5
minor 5
distance 5
arrive 5
offering 5
doubt 5
OMG 5
Having 5
watch 5
window 5
Come 5
Club 5
tempura 5
Sure 5
VERY 5
REALLY 5
tendon 5
coconut 5
suggestions 5
picked 5
lighting 5
greet 5
oyster 5
cleared 5
background 5
LOL 5
book 5
carry 5
nasty 5
Those 5
comments 5
pound 5
product 5
Perfect 5
treats 5
habit 5
Grilled 5
cross 5
realized 5
Artisan 5
refreshing 5
Order 5
clay 5
sashimi 5
imagine 5
Perhaps 5
Must 5
overs 5
Inn 5
honey 5
passed 5
Crispy 5
Thursday 5
lights 5
adult 5
tripe 5
Fortunes 5
recall 5
tax 5
moment 5
eye 5
closer 5
rich 5
coating 5
w/ 5
Matthew 5
har 5
desserts 5
apart 5
menus 5
Bad 5
poured 5
panda 5
sucked 5
im 5
eater 5
experienced 5
beverage 5
peppered 5
hubby 5
patient 5
casual 5
stands 5
OF 5
pots 5
.I 5
likely 5
example 5
Wan 5
miles 5
anymore 5
fork 5
thank 5
further 5
Terrible 5
shows 5
sprouts 5
Valley 5
west 5
diners 5
pickled 5
become 5
oh 5
Scottsdale 5
Area 5
view 5
hoping 5
Sherry 5
non 5
self 5
wide 5
P.F 5
Took 5
push 5
fall 5
Nam 5
Where 5
custom 5
cashier 5
establishments 5
noon 5
Mountain 5
herself 5
Shanghai 5
confused 5
liking 5
protein 5
case 5
18 5
negative 5
presented 5
rangoon 5
carrot 5
themselves 5
serves 5
whatever 5
enjoying 5
delightful 5
eaters 5
girlfriend 5
Five 5
reasonably 5
website 5
requests 5
disappoint 5
With 5
lunches 5
stuck 5
despite 5
congee 5
YUM 5
likes 5
kinds 5
figured 5
Decor 5
oysters 5
3rd 5
burnt 5
terms 5
chain 5
delicate 5
FOOD 5
Xiao 5
parts 5
certainly 5
Last 5
poorly 5
sucks 5
hopefully 5
thanks 5
nuts 5
trouble 5
potatoes 5
Cleveland 5
bun 5
Ice 5
choy 5
recommendation 5
crunch 5
stale 5
45 5
bus 5
welcome 5
stock 5
bringing 5
conveyer 5
AZ 5
hold 5
helping 5
inedible 5
chewing 5
became 5
younger 5
San 5
Can 5
scallion 5
hotpot 5
Anyway 5
eggs 5
Cha 5
ways 5
CASH 5
issue 5
forget 5
Yu 5
refund 5
Charlotte 5
toppings 5
WAS 5
patrons 5
podium 5
machine 5
5.95 5
older 5
wants 5
agree 5
Red 5
waitstaff 5
content 5
picky 5
repeat 5
pudding 5
Wo 5
dive 5
cattle 5
opted 5
hell 5
straight 5
discovered 5
covered 5
